{
    "projects": {
        "vast2022": {
            "title": "IEEE-VIS VAST Challenge-3 2022",
            "imgSrc": "./images/vast_cover.png",
            "shortDescription": "Visualizing the economic sector of Engagement city, Ohio",
            "longDescription": "This was a submission for the Visual Analytics, Science and Technology (VAST) challenge at IEEE-VIS 2022. I worked on mini-challenge 3 that investigated the economic sector of Engagement city at Ohio, USA. Based on data taken from a study, as well as information provided by participants over a period of months, the challenge asks to analyze the participants’ finances and business trends in the city. \n\n The first graph looks into individual participants’ background and finances. And the second graph takes a look into business prosperity. Taking a creative approach to the challenge, I used hues, shapes, sizes, textures, and proximity to represent various features of the dataset.",
            "languages": [
                "D3.js",
                "HTML",
                "CSS",
                "Python"
            ],
            "source": "IEEE-VIS",
            "challengeLink": "https://vast-challenge.github.io/2022/index.html",
            "github": "https://github.com/aishwaryamsk/vast-challenge-2022",
            "demoLink": "https://aishwaryamsk.github.io/vast-challenge-2022/economics.html"
        },
        "mostCommonObjsInPaintings": {
            "title": "20 Most Common Objects in Paintings",
            "imgSrc": "./images/paintings_cover.png",
            "shortDescription": "Visualizing 20 most common objects in paintings",
            "longDescription": "This is a personal project where I visualized the 20 most common objects in paintings since in the 1800s. The objects in the paintings were detected using the Google Cloud Vision API. \n\n Moving in a clockwise direction from the top, the labels in the pie-chart go in decreasing frequency of the objects painted. The inner curve marks the selected object. The strokes around the pie chart represent images that contain the object. Clicking on the labels in the pie-chart highlights the object. Hovering or clicking on the strokes around the pie-chart shows details regarding the painting. \n “Detected Labels” under the image of the painting lists the labels (or objects) detected using the Google Vision API.",
            "languages": [
                "D3.js",
                "HTML",
                "CSS",
                "Python"
            ],
            "source": "The Metropolitan Museum of Art",
            "github": "https://github.com/aishwaryamsk/top20ObjectsInPaintings",
            "demoLink": "https://aishwaryamsk.github.io/top20ObjectsInPaintings/the_met.html"
        },
        "covid19sentiments": {
            "title": "US State Sentiments Towards COVID-19",
            "imgSrc": "./images/choropleth_map_cover.png",
            "shortDescription": "Visualizing US state sentiments towards COVID-19",
            "longDescription": "This visualization was developed as part of a group project for the class Data and Visual Analytics (CSE 6242) at Georgia Institute of Technology. We visualized the sentiments of tweets related to COVID-19 in the US from 2020-2021. The slidable timeline selector allows users to specify the duration they are interested in. The choropleth map shows the average state sentiment towards COVID-19 during the selected period.",
            "languages": [
                "D3.js",
                "HTML",
                "CSS",
                "Python"
            ],
            "source": "Twitter",
            "refDataset": "https://github.com/lopezbec/COVID19_Tweets_Dataset",
            "github": "https://github.com/aishwaryamsk/covid19_policy_sentiments",
            "demoLink": "https://aishwaryamsk.github.io/covid19_policy_sentiments/map.html"
        },
        "ethnicitiesInGrammys": {
            "title": "Ethnicities in Grammy Awards",
            "imgSrc": "./images/grammy_awards_cover.png",
            "shortDescription": "Visualizing ethnicities in Grammy Awards",
            "longDescription": "This Tableau Storyboard on ethnicities in the Grammys was created as part of a group project for the class Data Visualization Principles (CS 6730) at Georgia Institute of Technology. We focused on major Grammy Award categories for a period of 20 years from 1999-2019 in this dataset. We also looked at Billboard Hot 100 during this period to find correlations between chart performance and award nominations/winnings. \n We utilized stacked bar charts, line charts, box plots, heat maps, and tree maps to narrate the story.",
            "languages": [
                "Tableau"
            ],
            "source": "Wikipedia",
            "demoLink": "https://public.tableau.com/shared/7MWWX42WY?:display_count=n&:origin=viz_share_link"
        },
        "multiTouchGrahingTool": {
            "title": "Multi-Touch Data Exploration Tool",
            "imgSrc": "./images/multi_touch_tool_cover.png",
            "shortDescription": "Pointer & Touch based data exploration tool",
            "longDescription": "This data exploration tool was developed as part of a group project for the class Principles of UI Software (CS 6456) at Georgia Institute of Technology. It allows users to interact with unit visualizations using purely touch or pointer (for example, pen) interactions. It allows users to assign colors, sizes, and custom shapes (using SVGs) to data points in the visualization. This tool is optimized for touch-based devices like tablets. \n\n <span class='bold-txt'>Multi-Touch Gestures:</span> Users can select data points via <i>lasso selection</i> using a single finger, resize data points using <i>two-finger pinch or spread</i>, undo or redo an action using <i>three-finger swipe left or right</i>, zoom or pan along an axis using <i>two-finger pinch or spread</i>, reset zoom with <i>two-finger double tap</i>, or sort data points along an axis by <i>long-pressing a single-finger</i> on an axis. \n\n <span class='bold-txt'>Features:</span> Users can color, resize or assign shapes to data points. They can also filter data, encode data attributes to size and color, view details of selected points, and undo or redo their actions. They can upload custom SVGs and color or resize the uploaded SVGs.",
            "languages": [
                "D3.js", "HTML", "CSS"
            ],
            "source": "Kaggle",
            "sourceLink": "https://www.kaggle.com/datasets/fivethirtyeight/the-ultimate-halloween-candy-power-ranking",
            "github": "https://github.com/aishwaryamsk/multitouch_graphing_tool",
            "demoLink": "https://aishwaryamsk.github.io/multitouch_graphing_tool/index.html"
        }
    },
    "about": {
        "profileImgSrc": "./images/profile.JPG",
        "endertLink": "http://va.gatech.edu/endert/",
        "andrisLink": "https://planning.gatech.edu/people/clio-andris",
        "emailImgSrc": "./images/email.png",
        "resumeLink": "https://www.dropbox.com/s/8718no1ax8m7u2f/Resume.pdf?dl=0"
    }
}
